In [68]:
import pandas as pd

In [69]:
file=pd.read_excel(r'C:\Users\HP\OneDrive\Desktop\naresh it data science\python\17 oct\16th,17th matplotlib\16th,17th matplotlib\dt, time split\TASK -- convert raw data - clean data.xlsx')

In [70]:
file

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13
0,NaN,THIS IS NOT CLEAN DATA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,ADDR,DT,NAME,time,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,"45 rd, kenith street, btm, bangalore 500038",2022-04-03 00:00:00,abc,8:30:21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,"45 rd, street, hitech, Hd 500038",2022-04-02 00:00:00,dec,5:30:21,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,THIS IS CLEAN DATA,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,House add,street,city,state,zip,month,data,year,name,hr,min,sec
8,NaN,NaN,45 rd,kenith,btm,banga,50038,3,4,2022,abc,8,30,21

In [71]:
# by this file we cannot extract or clean data easily
#stick to the basic and focus.let us create a data frame related to data

In [72]:
raw_table={
    "ADDR":["45 rd, kenith street, btm, bangalore 500038","45 rd,  street, hitech, Hd 500038"],
    "DT" :["03-04-2022","02-04-2022"],
    "NAME":["abc","dec"],
    "time":["8:30:21","5:30:21"]
}

df=pd.DataFrame(raw_table)
print(df)

                                          ADDR          DT NAME     time
0  45 rd, kenith street, btm, bangalore 500038  03-04-2022  abc  8:30:21
1            45 rd,  street, hitech, Hd 500038  02-04-2022  dec  5:30:21

# # expand=False or its a automatic default attched in str.split(","),which give list of strings./
# here expand=True gives in form of Data Frame,where each part of split will placed in seperate column like below

In [73]:
addr_split=df.ADDR.str.split(',',expand=True) #symtax remember
addr_split

# expand=False or its a automatic default attched in str.split(","),which give list of strings./
# here expand=True gives data frame,where each part of split will placed in seperate column like below

       0               1        2                  3
0  45 rd   kenith street      btm   bangalore 500038
1  45 rd          street   hitech          Hd 500038

In [74]:
df['House add']=addr_split[0]
df['House add']

#'House add','street','city','state','zip'

0    45 rd
1    45 rd
Name: House add, dtype: object

In [75]:
df['street']=addr_split[1]
df['street']

0     kenith street
1            street
Name: street, dtype: object

In [76]:
df['street']=addr_split[1].str.strip()
df['street']

#strip() we use if data have extra spaces it will removed

0    kenith street
1           street
Name: street, dtype: object

In [77]:
df['city']=addr_split[2].str.strip()
df['city']

0       btm
1    hitech
Name: city, dtype: object

In [78]:
df['state and pin']=addr_split[3].str.strip()
df['state and pin']

0    bangalore 500038
1           Hd 500038
Name: state and pin, dtype: object

In [79]:
df

,ADDR,DT,NAME,time,House add,street,city,state and pin
0,"45 rd, kenith street, btm, bangalore 500038",03-04-2022,abc,8:30:21,45 rd,kenith street,btm,bangalore 500038
1,"45 rd, street, hitech, Hd 500038",02-04-2022,dec,5:30:21,45 rd,street,hitech,Hd 500038

In [80]:
df['state']=df['state and pin'].str.split(' ',expand=True)[0]
df['state']

0    bangalore
1           Hd
Name: state, dtype: object

In [81]:
df['zip']=df['state and pin'].str.split(' ',expand=True)[1]
df['zip']

0    500038
1    500038
Name: zip, dtype: object

In [89]:
df[['date', 'month', 'year']] = df['DT'].str.split('-', expand=True)
df[['date', 'month', 'year']]

# df['day'],df['month'],df['year']=df['DT'].str.split('-',2).str
# df['day']

  date month  year
0   03    04  2022
1   02    04  2022

In [83]:
df.date

0    03
1    02
Name: date, dtype: object

In [84]:
df.month

0    04
1    04
Name: month, dtype: object

In [85]:
df.year

0    2022
1    2022
Name: year, dtype: object

In [92]:
df[['hr','min','sec']]=df['time'].str.split(':',expand=True)

df[['hr','min','sec']]

# df[['date', 'month', 'year']] = df['DT'].str.split('-', expand=True)
# df[['date', 'month', 'year']]

  hr min sec
0  8  30  21
1  5  30  21

In [93]:
df['hr']

0    8
1    5
Name: hr, dtype: object

In [94]:
df['min']

0    30
1    30
Name: min, dtype: object

In [95]:
df['sec']

0    21
1    21
Name: sec, dtype: object

In [97]:
df=df[['House add','street','city','state','zip','date', 'month', 'year','hr','min','sec']]
df

,House add,street,city,state,zip,date,month,year,hr,min,sec
0,45 rd,kenith street,btm,bangalore,500038,03,04,2022,8,30,21
1,45 rd,street,hitech,Hd,500038,02,04,2022,5,30,21